2_bc_ode/case/cylinder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    down
    {
        type            fixedValue;
        value    	uniform (0 0 0);
    }

    right
    {
        type            zeroGradient;
    }

    up
    {
        type            fixedValue;
        value    	uniform (0 0 0);
    }

    left
    {
        type            flowRateInletVelocity;
	meanVelocity	1;
	//profile 	sine;
	//amplitude	1;
	//frequency	10;
	//level		0;
    }

    cylinder
    {
        type            fixedValue;
        value    	uniform (0 0 0);
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
