2_bc_ode/case/cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    down
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          60;
        startFace       3890;
    }
    right
    {
        type            patch;
        nFaces          30;
        startFace       3950;
    }
    up
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          60;
        startFace       3980;
    }
    left
    {
        type            patch;
        nFaces          30;
        startFace       4040;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       4070;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          4000;
        startFace       4110;
    }
)

// ************************************************************************* //
